uhnp/src/DataProcessors/УрегулированиеДокументов/УрегулированиеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УрегулированиеДокументов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ДокументПродавца</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПокупателя</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПродажи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПокупки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/DataProcessors/УрегулированиеДокументов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		
		СтандартнаяОбработка = Ложь;
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	КонецЕсли;
	
	Элементы.ДокументыОтобратьРасхождения.Пометка = Истина;
	ПереключитьПодробно(ЭтаФорма, Ложь);
	
	ЗаполнитьТаблицуДокументов();
		
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("Организация") Тогда
		Настройки.Очистить(); //открытие из контекста, настройки не перезаполняем
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицуДокументов()
КонецПроцедуры

&НаКлиенте
Процедура Подробно(Команда)
	
	ПереключитьПодробно(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтобратьРасхождения(Команда)
	
	Элементы.ДокументыОтобратьВсе.Пометка = Ложь;
	Элементы.ДокументыОтобратьРасхождения.Пометка = Истина;
	
	ЗаполнитьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьВсе(Команда)
	
	Элементы.ДокументыОтобратьВсе.Пометка = Истина;
	Элементы.ДокументыОтобратьРасхождения.Пометка = Ложь;
	
	ЗаполнитьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПоступление(Команда)
	
	ТекущаяСтрока = Элементы.Документы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере(ТекущаяСтрока.ДокументПродавца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов()
КонецПроцедуры

&НаКлиенте
Процедура ПродавецПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов()
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов()
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Функция СформироватьНаСервере(РТУ = Неопределено)

	ТипПТУ = ВстраиваниеУХ.ТипДокументСсылкаПоступлениеТоваровУслуг();
	
	Если РТУ = Неопределено Тогда
		ТабДокументы = Объект.Документы.НайтиСтроки(Новый Структура("ДокументПокупателя", Новый (ТипПТУ)));
	Иначе 
		ТабДокументы = Объект.Документы.НайтиСтроки(Новый Структура("ДокументПродавца", РТУ));
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для каждого СтрокаДок Из ТабДокументы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДок.ДокументПокупателя) Тогда
			
			МетаданныеДок = Метаданные.НайтиПоТипу(ТипПТУ);
			НовыйДокумент = Документы[МетаданныеДок.Имя].СоздатьДокумент();

		Иначе	
			НовыйДокумент = СтрокаДок.ДокументПокупателя.ПолучитьОбъект();
		КонецЕсли;
		
		Если МетаданныеДок.Имя <> "ПоступлениеМСФО" Тогда
			
			МодульЗаполнения = ОбщегоНазначения.ОбщийМодуль(
				"УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ");
			МодульЗаполнения.ЗаполнитьПоступлениеТоваровУслугИзРеализации(
				НовыйДокумент, СтрокаДок.ДокументПродавца, "", Истина);
				
		КонецЕсли;
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);		
			Результат.Добавить(НовыйДокумент.Ссылка);
	
		Исключение
			
			ШаблонОшибки = НСтр("ru = 'Не удалось сформировать поступление по продаже <%1> по причине: %2'");
			Сообщить(СтрШаблон(ШаблонОшибки, СтрокаДок.ДокументПродавца, ОписаниеОшибки()));	
			
		КонецПопытки;
			
	КонецЦикла;
	
	ЗаполнитьТаблицуДокументов();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуДокументов()
	
	Если Объект.Организация.Пустая() Или Не ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		Возврат;
	ИначеЕсли Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УсловиеРТУ = "РеализацияТоваровУслуг.Контрагент.ОрганизационнаяЕдиница = &Покупатель";
	УсловиеРТУ = ?(Объект.Продавец.Пустая(), "ИСТИНА", УсловиеРТУ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса_Документы(), "&УсловиеРТУ", УсловиеРТУ);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Покупатель", 		Объект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", 		Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Продавец", 			Объект.Продавец);
	Запрос.УстановитьПараметр("ТолькоРасхождения", 	Элементы.ДокументыОтобратьРасхождения.Пометка);
		
	Объект.Документы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапроса_Документы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.СуммаДокумента - ЕСТЬNULL(ПоступлениеТоваровУслуг.СуммаДокумента, 0) КАК Расхождение,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаПродажи,
	|	ПоступлениеТоваровУслуг.СуммаДокумента КАК СуммаПокупки,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументПродавца,
	|	РеализацияТоваровУслуг.Дата КАК ДатаПродажи,
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПокупателя,
	|	ПоступлениеТоваровУслуг.Дата КАК ДатаПокупки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Контрагент.ОрганизационнаяЕдиница = ПоступлениеТоваровУслуг.Организация
	|			И (ПоступлениеТоваровУслуг.Контрагент.ОрганизационнаяЕдиница = РеализацияТоваровУслуг.Организация)
	|			И (ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.СуммаДокумента = ПоступлениеТоваровУслуг.СуммаДокумента
	|					ТОГДА ИСТИНА
	|				КОГДА РеализацияТоваровУслуг.Ссылка = ПоступлениеТоваровУслуг.ДокументОснование
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (ПоступлениеТоваровУслуг.Проведен)
	|			И (НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.Дата, ДЕНЬ))
	|			И (ИСТИНА)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РеализацияТоваровУслуг.Проведен
	|	И &Продавец В (РеализацияТоваровУслуг.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И РеализацияТоваровУслуг.Контрагент.ОрганизационнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ТолькоРасхождения
	|				ТОГДА РеализацияТоваровУслуг.СуммаДокумента <> ЕСТЬNULL(ПоступлениеТоваровУслуг.СуммаДокумента, 0)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И &УсловиеРТУ";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") Тогда //УХ, БМ, НМ
		Возврат ТекстЗапроса;
	ИначеЕсли УчетМСФОПовтИспУХ.ЕстьРСБУ() Тогда //ЕРПУХ
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПоступлениеТоваровУслуг", "ПриобретениеТоваровУслуг");
	Иначе 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументОснование", "Ссылка");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РеализацияТоваровУслуг", "РеализацияМСФО");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПоступлениеТоваровУслуг", "ПоступлениеМСФО");
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиентеНаСервереБезконтекста
Процедура ПереключитьПодробно(Форма, НоваяПометка = Неопределено)
	
	Элементы = Форма.Элементы;
	
	ПометкаПодробно = ?(НоваяПометка = Неопределено, Не Элементы.ДокументыПодробно.Пометка, НоваяПометка);
	
	Элементы.ДокументыПодробно.Пометка 			= ПометкаПодробно;
	Элементы.ДокументыСуммаПокупки.Видимость 	= ПометкаПодробно;
	Элементы.ДокументыСуммаПродажи.Видимость 	= ПометкаПодробно;
	
КонецПроцедуры

#КонецОбласти
